 $(document).ready(function(){
     function passData(x) {
        $(".gallery__item").fadeOut('slow').promise().done(function(){
            $(".gallery__h1").html(gallery[x].tittle);
            $(".gallery__p1").html(gallery[x].discription);
            $(".gallery__p2").html(gallery[x].discription_2);
            $(".gallery__img").attr( "src", gallery[x].screen);
            $(".gallery__item").fadeIn('slow');
         });
        
    };

    function switchSelector(x, y, z) {
        $(y).removeClass(x);
        $(z).addClass(x);
    };

	var gallery = [
        {
            tittle: "Головна сторінка юриста",
            discription: "Отримуй всю потрібну інформацію для роботи на одній сторінці.",
            discription_2: "Зручний доступ до всіх модулів: найближчих завдань, проектів, календаря з подіями та статистики доходів та активності, спілкуйся в спільному корпоративному чаті компанії",
            screen: "img/assets/dashboard_lawyer.png",
        },
        {
            tittle: "Завдання",
            discription: "Завдання Можливість створення завдання як по клієнту так і по клієнтському проекту із зазначенням типу часу, що витрачається на виконання задачі. Система дає можливість планувати свій час та час який заплановано виставити клієнту, що дає об’єктивність виставлення рахунку фактичних годин та оцінки правильності планування кожним юристом часу відведеного на виконання завдань.",
            discription_2: "Час витрачений на виконання завдань облікується в статистиці юриста, клієнта, конкретного проекту, відділу та компанії в цілому.",
            screen: "img/assets/task.png",
        },
        {
            tittle: "Проект",
            discription: "Створення проекту, який є по суті довгостроковим завданням з можливістю створення безлічі підзадач, що добре підходить для роботи по супроводженню проектів з вирішення спорів в суді. Наявність в проекті статистики запланованого та витраченого часу, доходу та витрат по проекту, спільна робота декількох юристів по одному проекту, спільний чат в якому можна спілкуватись з іншими юристами та клієнтом. Можливість створення швидкого проекту, який буде зручним приміром для виконання усної оплачуваної консультації, підготовки документу чи проведенні реєстраційної дії. Вартість послуг за створеним швидким проектом одразу переходить у запланований платіж, який після завершення завдання переходить в статус завершеної транзакції і потрапляє в статистику фінансів, тому окремо по таким проектам нічого вносити не потрібно.",
            discription_2: "",
            screen: "img/assets/project_page.png",
        },
        {
            tittle: "Профіль клієнта",
            discription: "Все про клієнта в одному місці. Контактні дані та можливість збереження безлічі представників. Всі клієнтські завдання та проекти, модуль фінансів та активності",
            discription_2: "",
            screen: "img/assets/client_profile_yur.png",
        },
        {
            tittle: "Клієнтський кабінет",
            discription: "Клієнт може не чекати дзвінка юриста чи телефонувати йому із типовим запитанням “ну що там у нас??”, адже він матиме доступ до всіх своїх проектів та завдань онлайн, з можливість спілкуватись з юристом в чаті, переглядати створені та завантажені документи, перелік завдань та витрачений на них час, витрачені кошти на реалізацію того чи іншого проекту.",
            discription_2: "",
            screen: "",
        },
        {
            tittle: "Профіль юриста",
            discription: "Оцінити ефективність роботи юриста зручно просто перейшовши в його профіль, в якому можна отримати інформацію про всі проекти та завдання юриста, доходи та витрати, активність з деталізацією по її типу (клієнський чи внутрішній білінг). Список всіх клієнтів в роботі по яким задіяний юриста та підрозділ в якому перебуває юрист",
            discription_2: "",
            screen: "img/assets/personnel_profile.png",
        },
        {
            tittle: "Активність",
            discription: "Ми юристи часто стикаємось з тим, що кожен день – тиждень - місяць пролітають як одна година і зовсім незрозуміло на що саме було витрачено купу часу. Система дає змогу облікувати витрачений час з можливістю деталізації як за юристами проектами та клієнтами, так і за типами активності, які можна змінювати чи доповнювати в системі на свій розсуд, за замовчуванням передбачено наступні типи білінгу: Клієнтський білінг (платний – робота яку оплачує клієнт, безкоштовний – робота яку клієнт може не оплачувати) Внутрішній білінгу: (адміністративний – організаційні задачі, маркетинговий – залучення клієнтів та робота з лояльністю, розвитку – самовдосконалення та участь у семінарах)",
            discription_2: "",
            screen: "img/assets/activity.png",
        },
        {
            tittle: "Доходи та витрати",
            discription: "Досі користуєшся блокнотом? Використовуй зручний модуль фінансів та витрат, який дає змогу швидко та легко створювати транзакції доходів, витрат чи трансферів між рахунками. Також система дає змогу створювати заплановані платежі, які будуть отримані в майбутньому, виставлені рахунки, які підлягають оплаті клієнтом, а також завершені транзакції. Статуси транзакцій можна змінювати від запланованих то завершених чи одразу вносити завершену транзакцію. Можливість створення будь якої кількості рахунків як для готівкових так і безготівкових коштів.",
            discription_2: "",
            screen: "img/assets/finance.png",
        },
        {
            tittle: "Доступ до відкритих даних ",
            discription: "Використання державних реєстрів може бути зручним. Підписуйся на зміни в ЄДРПОУ та оперативно отримуй актуальні дані. Зручний моніторинг судових засідань та судових рішень реалізований одразу в проекті. Інформація про наявність нового документа в Єдиному державному реєстрі судових рішень чи дати та часу судового засідання своєчасно надходить до чату проекту та сповіщає задіяних юристів та клієнта про останню інформацію.",
            discription_2: "",
            screen: "img/assets/Frame.jpg",
        },
    ];

    $.each( gallery, function( index, value ) {
        $("<li>"+ gallery[index].tittle +"</li>").appendTo(".gallery__tittles").addClass("gallery__tittle").attr( "gal_index", index);
        $("<li></li>").appendTo(".scroll-item-block").addClass("scroll-item").attr( "gal_index", index);
    });
    $(".gallery__tittle:first-child").addClass("selected");
    $(".scroll-item:first-child").addClass("scrol-selected");
    passData(0);

    $(".gallery__tittle").on("click", function (event){
        switchSelector("selected", ".selected", this);
        gal_index = $(this).attr('gal_index');

        $(".scroll-item").removeClass("scrol-selected");
        $(".scroll-item:eq("+ gal_index +")").addClass("scrol-selected");
        passData(gal_index);
    });

    $(".left-arrow").on("click", function (event){
        var cba_prev = $(".scrol-selected").prev();
        var cba_index = $(cba_prev).attr('gal_index');
        var abc_prev = $(".selected").prev()
            if ((cba_prev).length > 0) { 
                switchSelector("selected", ".selected", abc_prev);
                switchSelector("scrol-selected", ".scrol-selected", cba_prev);
                passData(cba_index);
        };
    });

    $(".right-arrow").on("click", function (event){   
        var cba_next = $(".scrol-selected").next();
        var cba_index = $(cba_next).attr('gal_index');
        var abc_next = $(".selected").next()
            if ((cba_next).length > 0) { 
                switchSelector("selected", ".selected", abc_next);
                switchSelector("scrol-selected", ".scrol-selected", cba_next);
                passData(cba_index);
        };
    });

    $(".scroll-item").on("click", function (event){
        switchSelector("scrol-selected", ".scrol-selected", this);
        var cba_index = $(this).attr('gal_index');
        var gal = $('.gallery__tittle[gal_index="'+ cba_index +'"]');
        switchSelector("selected", ".selected", gal);
        passData(cba_index);
    });
 });